docs/conf.org
#+startup: inlineimages showall
* Emacs configuration
** Directory structure

The directory structure is set up in [[../init.el][init.el]].

- ~lec/doc-dir~ for the documentation.
- ~lec/etc-directory~ for the additional configuration.
- ~lec/var-directory~ for the packages data.
- ~lec/doc-file~ for this configuration file.
- ~lec/tangled-doc-file~ is the output file for all tangled blocks from ~lec/doc-file~.

** Configuration
*** early-init.el file

GNU/Emacs 27.1 introduced early-init.el, which is run before init.el. Its main purpose here is to set GNU/Emacs with sane default to reflect the current configuration before loading everything. It prevent emacs to show in a non configured state.

As per GNU/Emacs  >= 28, native compilation can be enabled, resulting in ~*.eln~  files populating a directory at the root of the configuration directory. Redirect eln-cache files into an appropriate directory.

#+begin_src emacs-lisp :tangle ../early-init.el
  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (expand-file-name "var/eln-cache/" user-emacs-directory)))
#+end_src

Disable the menu bar, the tool bar, and the scroll bars.

#+begin_src emacs-lisp :tangle ../early-init.el
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src

Disable a lot of unused functions and features to speed things up, and set up sane defaults for garbage collection, process output, native JIT compilation, advice redefinition, and warning minimum level.

#+begin_src emacs-lisp :tangle ../early-init.el
  (setq package-enable-at-startup nil
        package-quickstart nil
        inhibit-startup-message t
        inhibit-startup-screen t
        server-client-instructions nil
        use-short-answers t
        auto-mode-case-fold nil
        ffap-machine-p-known 'reject
        fast-but-imprecise-scrolling t
        frame-inhibit-implied-resize t
        which-func-update-delay 1.0
        inhibit-compacting-font-caches t
        redisplay-skip-fontification-on-input t
        command-line-x-option-alist nil
        ring-bell-function 'ignore
        use-dialog-box nil
        mode-line-format nil
        default-input-method nil
        initial-major-mode 'fundamental-mode
        initial-scratch-message nil
        gc-cons-threshold (* 100 1024 1024) ; 100 MiB
        gc-cons-percentage 0.6
        read-process-output-max (* 5 1024 1024) ; 5 MiB
        load-prefer-newer t
        native-comp-jit-compilation t
        ad-redefinition-action 'accept
        warning-minimum-level :error
        warning-minimum-log-level :debug)
#+end_src

Set the language locale.

#+begin_src emacs-lisp :tangle ../early-init.el
  (set-language-environment "UTF-8")
#+end_src

Set the frame title to the buffer name.

#+begin_src emacs-lisp :tangle ../early-init.el
  (setq-default frame-title-format '("%b"))
#+end_src

Set the different fonts.

#+begin_src emacs-lisp :tangle ../early-init.el
  (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 100)
  (set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font" :height 100)
  (set-face-attribute 'variable-pitch nil :font "NotoSansDisplay Nerd Font" :height 100)
#+end_src

Change the colors for the background and foreground to respect the theme in use.

#+begin_src emacs-lisp :tangle ../early-init.el
  (add-to-list 'default-frame-alist '(foreground-color . "#d6d6d4"))
  (add-to-list 'default-frame-alist '(background-color . "#1c1e1f"))
#+end_src

Display a temporary helpful message in the modeline for the user.

#+begin_src emacs-lisp :tangle ../early-init.el
  (set-face-foreground 'mode-line "#d6d6d4")
  (set-face-background 'mode-line "#2d2e2e")
  (set-face-attribute 'mode-line nil :box nil)
  (set-face-attribute 'mode-line-inactive nil :box nil)
#+end_src

*** init.el file

If emacs is not at least in version 30, display an error message..

#+begin_src emacs-lisp :tangle ../init.el
  (when (version< emacs-version "30")
    (error "Emacs version < 30 is not supported"))
#+end_src

Declare and initialize all the variables for the directory structure and important files used in the literate configuration.

#+begin_src emacs-lisp :tangle ../init.el
  (defconst lec/doc-directory (file-name-concat user-emacs-directory "docs")
    "Directory where literate configuration in org-mode lies.")

  (defconst lec/etc-directory (file-name-concat user-emacs-directory "etc")
    "Directory where external configurations for packages goes.")

  (defconst lec/var-directory (file-name-concat user-emacs-directory "var")
    "Directory where temporary files and packages resources goes.")

  (defconst lec/doc-file (file-name-concat lec/doc-directory "conf.org")
    "Documentation file for the configuration.")

  (defconst lec/tangled-doc-file (file-name-concat lec/var-directory "tangled-conf.el")
    "File destination for tangled code blocks from the documentation.")
#+end_src

Install [[https://github.com/radian-software/straight.el][straight.el]] package manager.

#+begin_src emacs-lisp :tangle ../init.el
  (setq straight-check-for-modifications '(check-on-save find-when-checking)
        straight-base-dir lec/var-directory
        straight-repository-branch "develop"
        straight-vc-git-default-clone-depth 1
        comp-deferred-compilation-deny-list nil)
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" lec/var-directory))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

Install [[https://github.com/jwiegley/use-package][use-package]] to install [[https://github.com/radian-software/straight.el][straight.el]]  packages, load them on demand and manage their configuration.

#+begin_src emacs-lisp :tangle ../init.el
  (straight-use-package 'use-package)
  (setq use-package-always-ensure t
        use-package-always-defer t
        straight-use-package-by-default t)
#+end_src

Enable benchmarking early.

#+begin_src emacs-lisp :tangle ../init.el
  (use-package benchmark-init
    :hook (after-init . benchmark-init/deactivate)
    :init (benchmark-init/activate))
#+end_src

Install latest org mode before using it.

#+begin_src emacs-lisp :tangle ../init.el
  (use-package org)
#+end_src

Utilities functions related to the tangling of the files. Add hooks to tangle configuration when the documentation is modified. Also add headers to specify that these files should not be modified directly as they get rewritten each time the documentation is modified.

#+begin_src emacs-lisp :tangle ../init.el
  (defun lec/--tangle-documentation ()
    "Tangle the org file given to cache directory after renaming it."
    (require 'org)
    (org-babel-tangle-file lec/doc-file lec/tangled-doc-file))

  (defun lec/--editing-documentation ()
    "If the the file currently edited is the documentation configuration, tangle
  the code blocks."
    (when (string-match lec/doc-file buffer-file-name)
      (lec/--tangle-documentation)))

  (defun lec/--add-headers ()
    "Add headers at the start of tangled files with a simple warning about how
  they should not be modified directly."
    (goto-char (point-min))
    (insert ";;; -*- lexical-binding: t -*-\n")
    (insert ";;; This file is automatically generated. Do not edit directly.\n")
    (insert ";;; See `docs/README.org' for the original source.\n\n")
    (save-buffer))

  (add-hook 'after-save-hook #'lec/--editing-documentation)
  (add-hook 'org-babel-post-tangle-hook #'lec/--add-headers)
#+end_src

If the tangled configuration does not exists, tangle it.

#+begin_src emacs-lisp :tangle ../init.el
  (unless (file-exists-p lec/tangled-doc-file)
    (lec/--tangle-documentation))
#+end_src

Load the tangled configuration.

#+begin_src emacs-lisp :tangle ../init.el
  (load lec/tangled-doc-file)
#+end_src

And finally, specify a ~custom-file~ to load to avoid ~Customize~ options to rewrite this file.

#+begin_src emacs-lisp :tangle ../init.el
  (setq-default custom-file (file-name-concat lec/etc-directory "custom.el"))
  (load custom-file 'noerror 'nomessage)
#+end_src

*** Utility functions for GNU/Emacs configuration

#+begin_src emacs-lisp
  (defun lec/reload-configuration ()
    "Reload emacs configuration."
    (interactive)
    (load-file user-init-file))

  (defun lec/--file-contents (filename)
    "Return the contents of FILENAME."
    (with-temp-buffer
      (insert-file-contents filename)
      (buffer-string)))

  (defun lec/--bufferp (buffer)
    "Predicate that return nil if the buffer-name start with one of the things
  to exclude, else t."
    (cond ((string-match "^*" (buffer-name buffer)) nil)
          ((string-match "^magit" (buffer-name buffer)) nil)
          (t t)))

  (set-frame-parameter nil 'buffer-predicate 'lec/--bufferp)
#+end_src

Set the terminal tab name when the buffer changes. The function checks if emacs is in a terminal, then check if the ~buffer-name~ changed and is not empty, send a ~shell-command~ and check the ~exit-code~ to send a message if it's not zero.

#+begin_src emacs-lisp
  (defvar lec/--last-buffer-name nil
    "The last buffer name used for setting the WezTerm tab title.")

  (defun lec/--set-wezterm-tab-title ()
    "Set the wezterm tab title to the current buffer name if running in terminal
  mode."
    (when (not (display-graphic-p))
      (let ((current-buffer-name (buffer-name)))
        (when (and (not (string= current-buffer-name lec/--last-buffer-name))
                   (not (string= current-buffer-name "")))
          (shell-command (format "wezterm cli set-tab-title '%s'" current-buffer-name)))
          (setq lec/--last-buffer-name current-buffer-name))))

  (add-hook 'window-configuration-change-hook 'lec/--set-wezterm-tab-title)
#+end_src

** Emacs defaults

*** Avoid littering temporary files everywhere

#+begin_src emacs-lisp
  (use-package no-littering
    :demand t
    :custom
    (no-littering-etc-directory lec/etc-directory)
    (no-littering-var-directory lec/var-directory))
#+end_src

*** Base emacs configuration
**** Miscellaneous defaults

#+begin_src emacs-lisp
  (use-package emacs
    :custom
    (inibit-startup-message +1)
    (ring-bell-function 'ignore)
    (large-file-warning-threshold 100000000)
    (load-prefer-newer +1)
    (confirm-kill-processes nil)
    (use-dialog-box nil)
    :config
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (tooltip-mode -1)
    (set-fringe-mode 10)
    (column-number-mode +1)
    (size-indication-mode +1))
#+end_src

Highlight the current line.

#+begin_src emacs-lisp
  (use-package hl-line
    :hook ((text-mode . hl-line-mode)
           (org-mode . hl-line-mode)
           (prog-mode . hl-line-mode)))
#+end_src

Highlight undo and redos.

#+begin_src emacs-lisp
  (use-package undo-hl
    :straight (undo-hl :type git :host github :repo "casouri/undo-hl")
    :hook ((text-mode . undo-hl-mode)
           (org-mode . undo-hl-mode)
           (prog-mode . undo-hl-mode))
    :custom
    (undo-hl-undo-commands
     '(undo undo-tree-undo undo-tree-redo undo-tree-visualize-undo undo-tree-visualize-redo))
    :custom-face
    (undo-hl-insert ((t (:background "#B6E63E"))))
    (undo-hl-delete ((t (:background "#FB2874")))))
#+end_src

Reduce the performance impact of long lines in a file (eg. minified files).

#+begin_src emacs-lisp
  (use-package so-long
    :hook ((after-init . global-so-long-mode)))
#+end_src

Always insert the closing pair of parenthesis, brackets, curly brackets, and double quotes.

#+begin_src emacs-lisp
  (use-package elec-pair
    :hook ((org-mode . electric-pair-mode)
           (prog-mode . electric-pair-mode)))
#+end_src

Remember position in files.

#+begin_src emacs-lisp
  (use-package saveplace
    :hook (after-init . save-place-mode)
    :custom
    (save-place-forget-unreadable-files t))
#+end_src

**** Matching elements (parenthesis, quotes, etc)

[[https://github.com/Fanael/rainbow-delimiters][Rainbow-delimiters]] documentation.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook ((prog-mode . rainbow-delimiters-mode)))

  (use-package paren
    :hook (after-init . show-paren-mode))
#+end_src

**** Whitespaces

#+begin_src emacs-lisp
  (use-package whitespace
    :hook ((org-mode . whitespace-mode)
           (prog-mode . whitespace-mode))
    :custom
    (whitespace-style '(face trailing empty space-after-tab space-before-tab)))
#+end_src

